Catalogs/ТелВнутренние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ТелВнутренние</Name>
			<Comment>Внутренние телефоны (Интерфейс для внешней таблицы ТелАбоненты</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Домашний сервер телефонии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Базовое состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ТелКонвергенция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ТелКонвергенция</Name>
			<Comment>Конвергенция телефонов (FMC)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТелВнутренний</Name>
					<Comment>Внутренний телефон</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТелМобильный</Name>
					<Comment>Мобильный телефон</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелМобильные</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостояниеЭлементаПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>СостояниеЭлементаПредприятия</Name>
			<Comment>Состояние элемента предприятия</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служебный</Name>
					<Comment>Служебный элемент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключен</Name>
					<Comment>Неактивный элемент</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Предприятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Предприятие</Name>
			<Comment>Структура предприятия</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Холдер</Name>
					<Comment>Организация которой принадлежит рабочее место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Холдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхКанал</Name>
					<Comment>Канал для внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхЗапись</Name>
					<Comment>Состояние записи внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсхЗапрет</Name>
					<Comment>Запрет или разрешение на выполнение внешних исходящих звонков</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние элемента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЭлементаПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаРазмещения</Name>
					<Comment>Точка размещения группы или подразделения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиРазмещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Наименование элемента и его принадлежность</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОПропущенных</Name>
					<Comment>Оповещать о пропущенных звонках по эл.почте</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Текущий непосредтвенный руководитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОУ</Name>
					<Comment>Текущий сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОУ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Снилс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СотрудникиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОУ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РуководителиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Руководитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелевыеТочкиИстория</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТелВнутренние/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)

// Нормализация реквизитов
//-------------------------------------------------------------------------------------------------
	ЭтотОбъект.Код = СокрЛП(ЭтотОбъект.Код);
	ЭтотОбъект.Наименование = СокрЛП(ЭтотОбъект.Код);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтотОбъект.ПроверитьЗаполнение()) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

Процедура ПриЗаписи(Отказ)
	// С 18.11.2019 не пишем в абоненты
	Возврат;

	
	
	#Область Создание_записи_в_abonents_в_сервис_деске
	//Агрегатор оповещен через веб-сервис
	//-----------------------------------
	Если ДополнительныеСвойства.Свойство("ВнешняяЗапись") Тогда
		Если ДополнительныеСвойства.ВнешняяЗапись Тогда
			Если Не ЗначениеЗаполнено(Сервер) Тогда
				Сервер = Справочники.ТелСерверы.НайтиПоКоду("000000001");
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Состояние) Тогда
				Состояние = Справочники.ТелСостояния.НайтиПоКоду("000000002");
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти
	
// Подготовим информационную базу для перезаписи объекта
// Сначала удалим все записи о текущем телефоне с домашнего сервера и с сервера FMC
//-------------------------------------------------------------------------------------------------
	ПриЗаписиТелАбонентыУдалить(ЭтотОбъект.Сервер);

// Получим сведения о текущем владельце номера
// Если владелец получен, то продолжим обработку записи
//-------------------------------------------------------------------------------------------------
	ВладСсылка = Телефония.ВладелецПолучить(ЭтотОбъект.Ссылка);
	
	//<17.06.2019_10-39, +, не очищается пара FMC если не заполнент владелец>	
	Если ВладСсылка = Неопределено Тогда
		ВладСсылка = Справочники.Предприятие.ПустаяСсылка();
	КонецЕсли;
	//</17.06.2019_10-39>
	
	//<17.06.2019_10-39,//, не очищается пара FMC если не заполнент владелец>
	//Если (ЗначениеЗаполнено(ВладСсылка)) Тогда
	//</17.06.2019_10-39>
		ПриЗаписиТелАбоненты(Отказ,ВладСсылка);
	//<17.06.2019_10-39,//, не очищается пара FMC если не заполнент владелец>
	//КонецЕсли;
	//</17.06.2019_10-39>	

	Телефония.ТелВнутреннийСостояниеОбновить(ЭтотОбъект.Ссылка);
КонецПроцедуры

Процедура ПриЗаписиТелАбоненты(Отказ,ВладСсылка)
	
// Выполним корректировки в таблицах ABONENTS для данного номера телефона
// Получим сведения о текущем состоянии телефона
//-------------------------------------------------------------------------------------------------
	СтрСостояния = Телефония.ТелВнутреннийСостояниеПолучить(ЭтотОбъект.Ссылка);

	Если (ТипЗнч(СтрСостояния) <> Тип("Структура")) Тогда
		ТекстСообщения = СокрЛП(ЭтотОбъект.Код) + " - при записи данных в таблицу ABONENTS произошла ";
		ТекстСообщения = ТекстСообщения + "ошибка: не удалось получить структуру текущего состояния";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

// Очистим сведения о конвергенции для текущего телефона и для его мобильной пары
//-------------------------------------------------------------------------------------------------
	Телефония.КонвергенцияРегистрУдалить(СтрСостояния.ПараФмс);
	Телефония.КонвергенцияРегистрУдалить(ЭтотОбъект.Ссылка);

// Получим сведения о наличии и типе конвергенции на номере
// Если объект записывается интерактивно, то получим данные переданные из формы
// Пересоздадим конвергентную пару в регистре если это необходимо и возможно
//-------------------------------------------------------------------------------------------------
	Доступно = (ЭтотОбъект.ДополнительныеСвойства.Свойство("ПараФМС") = Истина);
	ПараФмс = ?(Доступно,ЭтотОбъект.ДополнительныеСвойства.ПараФМС,СтрСостояния.ПараФмс);
	ТипФмс = ?(ЗначениеЗаполнено(ПараФмс),ПараФмс.ТипФмс.СерверныйКод,"");

	Если (ЗначениеЗаполнено(ТипФмс)) Тогда
		НовЗапись = РегистрыСведений.ТелКонвергенция.СоздатьМенеджерЗаписи();
		НовЗапись.ТелВнутренний = ЭтотОбъект.Ссылка;
		НовЗапись.ТелМобильный = ПараФмс;
		НовЗапись.Записать(Истина);
	КонецЕсли;

// Для владельца телефона получим ссылку на подразделение
// Выполним формирование записи ABONENTS для домашнего сервера
//-------------------------------------------------------------------------------------------------
	ВладСсылка = ?(ВладСсылка.ЭтоГруппа,ВладСсылка,ВладСсылка.Родитель);
	СерверИмя = СокрЛП(ЭтотОбъект.Сервер.ИсточникДанных);

	Если (ЗначениеЗаполнено(СерверИмя)) Тогда
		АбонОбъект = ВнешниеИсточникиДанных[СерверИмя].Таблицы.ТелАбоненты.СоздатьОбъект();
		АбонОбъект.abonent_num = ВРег(СокрЛП(ЭтотОбъект.Код));
		АбонОбъект.additions = "";
		АбонОбъект.custom = "";

// Тип абонента (тип стационарного телефона и тип услуги FMC)
//-------------------------------------------------------------------------------------------------
		Доступно = (СтрСостояния.ТипТерминала = "S");
		Доступно = Доступно ИЛИ (СтрСостояния.ТипТерминала = "A");
		АбонОбъект.abonent_type = ?(Доступно,СтрСостояния.ТипТерминала,"");
		АбонОбъект.abonent_type = СокрЛП(АбонОбъект.abonent_type) + ВРег(СокрЛП(ТипФмс));


// Разрешение записи исходящих звонков
//-------------------------------------------------------------------------------------------------
		Доступно = (СтрНайти(АбонОбъект.additions,"Z") = 0);
		Доступно = Доступно И (ВладСсылка.ИсхЗапись = Истина);
		Доступно = Доступно И (ВладСсылка.Состояние <> Перечисления.СостояниеЭлементаПредприятия.Отключен);
		АбонОбъект.additions = СокрЛП(АбонОбъект.additions) + ?(Доступно,"R","");
		

// Если тип абонента заполнен, то выполним запись объекта
//-------------------------------------------------------------------------------------------------
		Если (ЗначениеЗаполнено(АбонОбъект.abonent_type)) Тогда
			Попытка
				АбонОбъект.Записать();
			Исключение
				ТекстСообщения = СокрЛП(ЭтотОбъект.Код) + " - при записи объекта в таблицу ";
				ТекстСообщения = ТекстСообщения + "ABONENTS произошла ошибка источника данных ";
				ТекстСообщения = ТекстСообщения + СокрЛП(СерверИмя) + ": " + СокрЛП(ОписаниеОшибки());
				Сообщить(ТекстСообщения);
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

// Корректировка ABONENTS на домашнем сервере выполнена
// Выполним формирование записи ABONENTS для сервера услуги FMC (если необходимо)
//-------------------------------------------------------------------------------------------------
	Доступно = (ЭтотОбъект.Сервер <> Константы.СерверФМС.Получить());
	Доступно = Доступно И ЗначениеЗаполнено(ТипФмс);

	Если (Доступно = Ложь) Тогда
		Возврат;
	КонецЕсли;

// Создадим объект ABONENTS
//-------------------------------------------------------------------------------------------------
	СерверИмя = СокрЛП(Константы.СерверФМС.Получить().ИсточникДанных);

	АбонОбъект = ВнешниеИсточникиДанных[СерверИмя].Таблицы.ТелАбоненты.СоздатьОбъект();
	АбонОбъект.abonent_num = ВРег(СокрЛП(ЭтотОбъект.Код));
	АбонОбъект.abonent_type = ВРег(СокрЛП(ТипФмс));
	АбонОбъект.additions = "Z";
	АбонОбъект.custom = "";
	
	// Выполним запись объекта
	//-------------------------------------------------------------------------------------------------
	Попытка
		// С 18.11.2019 не пишем в абоненты
		//АбонОбъект.Записать();
	Исключение
		ТекстСообщения = СокрЛП(ЭтотОбъект.Код) + " - при записи объекта в таблицу ";
		ТекстСообщения = ТекстСообщения + "ABONENTS произошла ошибка источника данных ";
		ТекстСообщения = ТекстСообщения + СокрЛП(СерверИмя) + ": " + СокрЛП(ОписаниеОшибки());
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

Процедура ПриЗаписиТелАбонентыУдалить(СерверСсылка)

// Процедура удаляет записи о телефоне из таблиц ABONENTS на домашнем сервере и на сервере FMC
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(СерверСсылка.ИсточникДанных)) Тогда
		ТелНомер = ВРег(СокрЛП(ЭтотОбъект.Код));
		СерверИмя = СокрЛП(СерверСсылка.ИсточникДанных);
		Попытка
			АбонСсылка="";
			АбонСсылка = ВнешниеИсточникиДанных[СерверИмя].Таблицы.ТелАбоненты.НайтиПоПолю("abonent_num",ТелНомер);
		Исключение
			Данные = "СерверСсылка = "+СерверСсылка;
			Комментарий = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ПриЗаписиТелАбонентыУдалить", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТелВнутренние, Данные, Комментарий);
		КонецПопытки;
		Если (ЗначениеЗаполнено(АбонСсылка)) Тогда
			АбонСсылка.ПолучитьОбъект().Удалить();
		КонецЕсли;
	КонецЕсли;

// Если переданный Сервер не является сервером FMC, то выполним удаление записи и с сервера FMC
//-------------------------------------------------------------------------------------------------
	Если (СерверСсылка <> Константы.СерверФМС.Получить()) Тогда
		ПриЗаписиТелАбонентыУдалить(Константы.СерверФМС.Получить());
	КонецЕсли;
КонецПроцедуры
